In [12]:
!pip install ipython-sql psycopg2

Collecting ipython-sql
  Using cached ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Requirement already satisfied: psycopg2 in c:\users\user\anaconda3\lib\site-packages (2.9.8)
Requirement already satisfied: sqlparse in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: prettytable in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: six in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (2.0.21)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.8.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.0)
Requirement already satisfied: traitlets>=4.2 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.0)
Requirement already satisfied: pygments in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.10.0)
Requirement already satisfied: colorama in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.4)
Requirement already satisfied: setuptools>=18.5 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (58.0.4)
Requirement already satisfied: pickleshare in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.2)
Requirement already satisfied: decorator in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\user\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\users\user\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.2.5)
Installing collected packages: ipython-sql
Successfully installed ipython-sql-0.5.0

In [14]:
%load_ext sql

In [15]:
%sql postgresql://postgres:secret@localhost:5432/sql_db

In [16]:
%%sql

CREATE TABLE customers (id SERIAL,
                        name VARCHAR (50) NOT NULL,
                        email VARCHAR (50),
                        tel VARCHAR(20),
                        created_at TIMESTAMP,
                        updated_at TIMESTAMP,
                        PRIMARY KEY(id)
);

INSERT INTO customers VALUES
(1, 'Irfan Bakti', 'irfan88@example.com',' +60123456789', '2019-08-07 08:13:21', '2019-08-07 08:13:21'),
(2, 'Jack Smmith', 'jack.smmith@acme.io', '+60132456781', '2019-08-07 08:13:21', '2019-08-07 08:13:21'),
(3, 'Nazir', '', '+601185434012','2019-08-07 08:13:21',' 2019-08-07 08:13:21'),
(4, 'Faiz Ma', 'faiz.ma@iholow.cn ', '+6019772002','2019-08-07 08:13:21',' 2019-08-07 08:13:21'),
(5, 'Isham Rais', 'isham@pmo.gov.my', '+60135482020','2019-08-07 08:13:21',' 2019-08-07 08:13:21'),
(6, 'Shanon Teoh', 'shahnon.teoh@st.com.sg', '','2019-08-07 08:13:21',' 2019-08-07 08:13:21');

 * postgresql://postgres:***@localhost:5432/sql_db
Done.
6 rows affected.

[]

In [18]:
%%sql

CREATE TABLE invoices (id SERIAL,
                       number INT NOT NULL,
                       sub_total NUMERIC(1000,2),
                       tax_total NUMERIC(1000,2),
                       total NUMERIC(1000,2),
                       customer_id INT,
                       created_at TIMESTAMP,
                       updated_at TIMESTAMP,
                       PRIMARY KEY(id),
                       CONSTRAINT fk_customer
                       FOREIGN KEY(customer_id) REFERENCES customers(id)
                      );

INSERT INTO invoices
VALUES 
(1, 20190001, 30.00, 0.00, 30.00, 1,'2019-08-07 08:13:21', '2019-08-07 08:13:21'),
(2, 20190002, 150.00,  0.00, 150.00, 2, '2019-08-07 08:13:21', '2019-08-07 08:13:21'),
(3, 20190003, 30.00,  0.00, 30.00, 2,'2019-09-15 08:13:21',' 2019-09-15 08:13:21'),
(4, 20190004, 55.00,  0.00, 55.00, 3, '2019-09-15 08:13:21',' 2019-09-15 08:13:21'),
(5, 20190005, 450.00,  0.00, 0.00, 6, '2019-09-15 08:13:21',' 2019-09-15 08:13:21');


CREATE TABLE invoice_lines (id SERIAL,
                            description VARCHAR(50),
                            unit_price NUMERIC(1000,2),
                            quantity INT,
                            sub_total NUMERIC(1000,2),
                            tax_total NUMERIC(1000,2),
                            total NUMERIC(1000,2),
                            tax_id varchar(30),
                            sku_id INT,
                            invoice_id INT,
                            PRIMARY KEY(id), 
                            CONSTRAINT fk_invoices
                            FOREIGN KEY(invoice_id) REFERENCES invoices(id)
                           );


INSERT INTO invoice_lines
VALUES 
(1, 'Book #1', 30.00, 1, 30.00, 0.00, 30.00,'NULL', 1, 1),
(2, 'Book #2', 25.00, 4, 100.00, 0.00, 100.00, 'NULL', 2, 2),
(3, 'Book #3', 50.00, 1, 50.00, 0.00, 50.00, 'NULL', 3, 2),
(4, 'Book #1', 30.00, 1, 30.00, 0.00, 30.00, 'NULL', 1, 3),
(5, 'Book #1', 30.00, 1, 30.00, 0.00, 30.00, 'NULL', 1, 4),
(6, 'Book #2', 25.00, 1, 25.00, 0.00, 25.00, 'NULL', 2, 4),
(7, 'Book #1', 30.00, 5, 150.00, 0.00, 150.00, 'NULL', 1, 5),
(8, 'Book #3', 50.00, 6, 300.00, 0.00, 300.00, 'NULL', 3, 5);

 * postgresql://postgres:***@localhost:5432/sql_db
Done.
5 rows affected.
Done.
8 rows affected.

[]

In [19]:
%%sql

SELECT * FROM invoices;

 * postgresql://postgres:***@localhost:5432/sql_db
5 rows affected.

[(1, 20190001, Decimal('30.00'), Decimal('0.00'), Decimal('30.00'), 1, datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 21)),
 (2, 20190002, Decimal('150.00'), Decimal('0.00'), Decimal('150.00'), 2, datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 21)),
 (3, 20190003, Decimal('30.00'), Decimal('0.00'), Decimal('30.00'), 2, datetime.datetime(2019, 9, 15, 8, 13, 21), datetime.datetime(2019, 9, 15, 8, 13, 21)),
 (4, 20190004, Decimal('55.00'), Decimal('0.00'), Decimal('55.00'), 3, datetime.datetime(2019, 9, 15, 8, 13, 21), datetime.datetime(2019, 9, 15, 8, 13, 21)),
 (5, 20190005, Decimal('450.00'), Decimal('0.00'), Decimal('0.00'), 6, datetime.datetime(2019, 9, 15, 8, 13, 21), datetime.datetime(2019, 9, 15, 8, 13, 21))]

In [20]:
%%sql

SELECT * FROM invoice_lines;

 * postgresql://postgres:***@localhost:5432/sql_db
8 rows affected.

[(1, 'Book #1', Decimal('30.00'), 1, Decimal('30.00'), Decimal('0.00'), Decimal('30.00'), 'NULL', 1, 1),
 (2, 'Book #2', Decimal('25.00'), 4, Decimal('100.00'), Decimal('0.00'), Decimal('100.00'), 'NULL', 2, 2),
 (3, 'Book #3', Decimal('50.00'), 1, Decimal('50.00'), Decimal('0.00'), Decimal('50.00'), 'NULL', 3, 2),
 (4, 'Book #1', Decimal('30.00'), 1, Decimal('30.00'), Decimal('0.00'), Decimal('30.00'), 'NULL', 1, 3),
 (5, 'Book #1', Decimal('30.00'), 1, Decimal('30.00'), Decimal('0.00'), Decimal('30.00'), 'NULL', 1, 4),
 (6, 'Book #2', Decimal('25.00'), 1, Decimal('25.00'), Decimal('0.00'), Decimal('25.00'), 'NULL', 2, 4),
 (7, 'Book #1', Decimal('30.00'), 5, Decimal('150.00'), Decimal('0.00'), Decimal('150.00'), 'NULL', 1, 5),
 (8, 'Book #3', Decimal('50.00'), 6, Decimal('300.00'), Decimal('0.00'), Decimal('300.00'), 'NULL', 3, 5)]

### Question 2

####  b. Show the SQL query for number of customers purchasing more than 5 books

In [28]:
%%sql

SELECT COUNT(*) as count_customer 
FROM invoice_lines
WHERE quantity > 5;

 * postgresql://postgres:***@localhost:5432/sql_db
1 rows affected.

[(1,)]

#### c. Show the SQL query for a list of customers who never purchased anything

In [29]:
%%sql

SELECT *
FROM customers AS c
LEFT JOIN invoices AS i
    ON i.customer_id = c.id
WHERE customer_id IS NULL;

 * postgresql://postgres:***@localhost:5432/sql_db
2 rows affected.

[(4, 'Faiz Ma', 'faiz.ma@iholow.cn ', '+6019772002', datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 21), None, None, None, None, None, None, None, None),
 (5, 'Isham Rais', 'isham@pmo.gov.my', '+60135482020', datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 21), None, None, None, None, None, None, None, None)]

#### d. Show the SQL query for list of book purchased with the users

In [34]:
%%sql

SELECT c.name, l.description
FROM customers AS c
LEFT JOIN invoices AS i
    ON i.customer_id = c.id
LEFT JOIN invoice_lines AS l
    ON l.invoice_id = i.id
WHERE customer_id IS NOT NULL;

 * postgresql://postgres:***@localhost:5432/sql_db
8 rows affected.

[('Irfan Bakti', 'Book #1'),
 ('Jack Smmith', 'Book #1'),
 ('Jack Smmith', 'Book #3'),
 ('Jack Smmith', 'Book #2'),
 ('Nazir', 'Book #2'),
 ('Nazir', 'Book #1'),
 ('Shanon Teoh', 'Book #3'),
 ('Shanon Teoh', 'Book #1')]